ra-rs/ra/svd/vendor/R7FA4L1BD.svd
                <register>
                    <name>PRCR</name>
                    <description>Protect Register</description>
                    <addressOffset>0x3FE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>PRC0</name>
                            <description>Enable writing to the registers related to the clock generation circuit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable writes</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable writes</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PRC1</name>
                            <description>Enable writing to the registers related to the low power modes</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable writes</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable writes</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PRC3</name>
                            <description>Enable writing to the registers related to the LVD</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable writes</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable writes</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PRC4</name>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable writes</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable writes</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PRKEY</name>
                            <description>PRC Key Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYOCDCR</name>
                    <description>System Control OCD Control Register</description>
                    <addressOffset>0x040E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>DBGEN</name>
                            <description>Debugger Enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>On-chip debugger is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>On-chip debugger is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTSR0</name>
                    <description>Reset Status Register 0</description>
                    <addressOffset>0x410</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xf0</resetMask>
                    <fields>
                        <field>
                            <name>PORF</name>
                            <description>Power-On Reset Detect Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Power-on reset not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Power-on reset detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD0RF</name>
                            <description>Voltage Monitor 0 Reset Detect Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage monitor 0 reset not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage monitor 0 reset detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1RF</name>
                            <description>Voltage Monitor 1 Reset Detect Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage monitor 1 reset not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage monitor 1 reset detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD2RF</name>
                            <description>Voltage Monitor 2 Reset Detect Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage monitor 2 reset not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage monitor 2 reset detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTSR2</name>
                    <description>Reset Status Register 2</description>
                    <addressOffset>0x411</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xfe</resetMask>
                    <fields>
                        <field>
                            <name>CWSF</name>
                            <description>Cold/Warm Start Determination Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Cold start</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Warm start</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MOMCR</name>
                    <description>Main Clock Oscillator Mode Oscillation Control Register</description>
                    <addressOffset>0x413</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>MODRV1</name>
                            <description>Main Clock Oscillator Drive Capability 1 Switching</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>10 MHz to 20 MHz</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>1 MHz to 10 MHz</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MOSEL</name>
                            <description>Main Clock Oscillator Switching</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Resonator</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>External clock input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVD1CMPCR</name>
                    <description>Voltage Monitoring 1 Comparator Control Register</description>
                    <addressOffset>0x417</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0b</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>LVD1LVL</name>
                            <description>Voltage Detection 1 Level Select</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>Vdet1_0</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>Vdet1_1</description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>Vdet1_2</description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x03</name>
                                    <description>Vdet1_3</description>
                                    <value>0x03</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>Vdet1_4</description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x05</name>
                                    <description>Vdet1_5</description>
                                    <value>0x05</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x06</name>
                                    <description>Vdet1_6</description>
                                    <value>0x06</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x07</name>
                                    <description>Vdet1_7</description>
                                    <value>0x07</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x08</name>
                                    <description>Vdet1_8</description>
                                    <value>0x08</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x09</name>
                                    <description>Vdet1_9</description>
                                    <value>0x09</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0A</name>
                                    <description>Vdet1_A</description>
                                    <value>0x0a</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B</name>
                                    <description>Vdet1_B</description>
                                    <value>0x0b</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1E</name>
                            <description>Voltage Detection 1 Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage detection 1 circuit disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage detection 1 circuit enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
