ra-rs/ra/svd/vendor/R7FA4L1BD.svd
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>DEVADD%s</name>
                    <description>Device Address %s Configuration Register</description>
                    <addressOffset>0x0D0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>USBSPD</name>
                            <description>Transfer Speed of Communication Target Device</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Do not use DEVADDn</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Low-speed</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Full-speed</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>UARTA</name>
            <description>UARTA</description>
            <baseAddress>0x40097000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>22</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>TXBA%s</name>
                    <description>Transmit Buffer Register %s</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xff</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>RXBA%s</name>
                    <description>Receive Buffer Register %s</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xff</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>ASIMA%s0</name>
                    <description>Operation Mode Setting Register n0</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>ISRMA</name>
                            <description>Receive interrupt mode select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The UARTAn_ERI interrupt is generated when a reception error occurs (UARTAn_RXI is not generated)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The UARTAn_RXI interrupt is generated when a reception error occurs (UARTAn_ERI is not generated)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISSMA</name>
                            <description>Transmit interrupt mode select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The UARTAn_TXI interrupt is generated on completion of transmission</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The UARTAn_TXI interrupt is generated when the transmit buffer becomes empty (for continuous transmission)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXEA</name>
                            <description>Reception enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables reception (reset the reception circuit)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables reception</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXEA</name>
                            <description>Transmission enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables transmission (resets the transmission circuit)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables transmission</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>UART operation enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables the UART operation clock (resets the internal circuits)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables the UART operation clock</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>ASIMA%s1</name>
                    <description>Operation Mode Setting Register n1</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1a</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>ALV</name>
                            <description>Transmission and reception level setting</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Positive logic (wait state = high level, start bit = low level, stop bit = high level)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negative logic (wait state = low level, start bit = high level, stop bit = low level)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>Transmission and reception order setting</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>MSB-first</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>LSB-first</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SL</name>
                            <description>Transmission stop bit length setting</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stop bit length = 1 bit</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stop bit length = 2 bits</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CL</name>
                            <description>Transmission and reception character length setting</description>
                            <lsb>3</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Character length of data = 5 bits</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Setting prohibited</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Character length of data = 7 bits</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Character length of data = 8 bits</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS</name>
                            <description>Transmission and reception parity bit setting</description>
                            <lsb>5</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Transmission: No parity bit is output. Reception: Data is received without parity. </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Transmission: 0 parity is output. Reception: Data is received with 0 parity. </description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Transmission: Odd parity is output. Reception: Check is made for odd parity. </description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Transmission: Even parity is output. Reception: Check is made for even parity. </description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>BRGCA%s</name>
                    <description>Baud Rate Generator Control Register %s</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xff</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>ASISA%s</name>
                    <description>Status Register %s</description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>OVEA</name>
                            <description>Overrun error flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error has occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An error has occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FEA</name>
                            <description>Framing error flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error has occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An error has occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PEA</name>
                            <description>Parity error flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error has occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An error has occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXSFA</name>
                            <description>Transmit shift register data flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data is not being transmitted</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data is being transmitted</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXBFA</name>
                            <description>Transmit buffer data flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No valid data exists in the TXBAn register</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Valid data exists in the TXBAn register</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
