ra-rs/ra/svd/vendor/R7FA4L1BD.svd
                <register>
                    <name>CTSUSR</name>
                    <description>CTSU Status Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MFC</name>
                            <description>CTSU Multi-Clock Counter</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Multi-clock 0</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Multi-clock 1</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Multi-clock 2</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Multi-clock 3</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICOMPRST</name>
                            <description>CTSU ICOMP0 and ICOMP1 Flags Reset</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ICOMP1</name>
                            <description>CTSU Sense Current Error Monitor</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal sensor current</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Abnormal sensor current</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICOMP0</name>
                            <description>Over-Voltage Detection Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Over-voltage is detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STC</name>
                            <description>CTSU Measurement Status Counter</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Status 0</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Status 1</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>Status 2</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Status 3</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>Status 4</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>Status 5</description>
                                    <value>#101</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DTSR</name>
                            <description>CTSU Data Transfer Status Flag</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Read</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Not read</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SENSOVF</name>
                            <description>CTSU Sensor Counter Overflow Flag</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No overflow occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Overflow occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SUCKOVF</name>
                            <description>CTSU SUCLK Counter Overflow Flag</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No overflow occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Overflow occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS</name>
                            <description>CTSU Mutual Capacitance Status Flag</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>First measurement</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Second measurement</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSRL</name>
                    <description>CTSU Status Register</description>
                    <alternateRegister>CTSUSR</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSR0</name>
                    <description>CTSU Status Register</description>
                    <alternateRegister>CTSUSR</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <name>CTSUST</name>
                    <description>CTSU Status Register</description>
                    <alternateRegister>CTSUSR</alternateRegister>
                    <addressOffset>0x1D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <name>CTSUSRH</name>
                    <description>CTSU Status Register</description>
                    <alternateRegister>CTSUSR</alternateRegister>
                    <addressOffset>0x1E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSR2</name>
                    <description>CTSU Status Register</description>
                    <alternateRegister>CTSUSRH</alternateRegister>
                    <addressOffset>0x1E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <name>CTSUSO</name>
                    <description>CTSU Sensor Offset Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>CTSU Sensor Offset Adjustment</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNUM</name>
                            <description>CTSU Measurement Count Setting</description>
                            <lsb>10</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSDIV</name>
                            <description>Spread Spectrum Frequency</description>
                            <lsb>20</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDPA</name>
                            <description>CTSU Base Clock Setting</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSO0</name>
                    <description>CTSU Sensor Offset Register</description>
                    <alternateRegister>CTSUSO</alternateRegister>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSO1</name>
                    <description>CTSU Sensor Offset Register</description>
                    <alternateRegister>CTSUSO</alternateRegister>
                    <addressOffset>0x22</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSCNT</name>
                    <description>CTSU Sensor Counter Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SENSCNT</name>
                            <description>CTSU Sensor Counter</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SUCKCNT</name>
                            <description>CTSU SUCLK Counter</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSC</name>
                    <description>CTSU Sensor Counter Register</description>
                    <alternateRegister>CTSUSCNT</alternateRegister>
                    <addressOffset>0x24</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
