ra-rs/ra/svd/vendor/R7FA4L1BD.svd
                <register>
                    <name>AJ</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPT</alternateRegister>
                    <addressOffset>0x41</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>AJFEN</name>
                            <description>Automatic Judgment Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Automatic judgment function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Automatic judgment function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AJINTC</name>
                            <description>Automatic Judgment Interrupt Control</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>INTFN_N for touch detection, INTAJN_N for non-touch detection</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>INTFN_N only regardless of touch/non-touch detection</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUOPTH</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPT</alternateRegister>
                    <addressOffset>0x42</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SCACTB</name>
                            <description>Sensor Counter Automatic Correction Table Number Setting</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ACSB</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPTH</alternateRegister>
                    <addressOffset>0x42</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SCACTB</name>
                            <description>Sensor Counter Automatic Correction Table Number Setting</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSCNTACT</name>
                    <description>CTSU Sensor Counter Automatic Correction Table Access Register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SCNTACCOEFF</name>
                            <description>Sensor Counter Correction Coefficient Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCNTACCOUNT</name>
                            <description>Set the measurement value to be compared.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSCNTACTL</name>
                    <description>CTSU Sensor Counter Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUSCNTACT</alternateRegister>
                    <addressOffset>0x44</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SCNTACCOEFF</name>
                            <description>Sensor Counter Correction Coefficient Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSCNTACTH</name>
                    <description>CTSU Sensor Counter Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUSCNTACT</alternateRegister>
                    <addressOffset>0x46</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SCNTACCOUNT</name>
                            <description>Set the measurement value to be compared.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT1</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT1L</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT1</alternateRegister>
                    <addressOffset>0x4C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT1H</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT1</alternateRegister>
                    <addressOffset>0x4E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT2</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT2L</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT2</alternateRegister>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT2H</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT2</alternateRegister>
                    <addressOffset>0x52</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT3</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT3L</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT3</alternateRegister>
                    <addressOffset>0x54</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT3H</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT3</alternateRegister>
                    <addressOffset>0x56</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJCR</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TLOT</name>
                            <description>Non-Touch Judgment Criterion Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THOT</name>
                            <description>Touch Judgment Criterion Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLINI</name>
                            <description>Baseline Initialization</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Perform baseline operations</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Initialize the results of baseline operations</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>JC</name>
                            <description>Judgment Condition Setting</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Judges as touch when there is one or more touch detections</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Judges as touch when there are two or more touch detections</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Judges as touch when there are three or more touch detections</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Judges as touch only when there are four touch detections</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AJMMAT</name>
                            <description>Measured Value Moving Average Number Setting</description>
                            <lsb>24</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AJBMAT</name>
                            <description>Baseline Average Number Setting</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJCRL</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCR</alternateRegister>
                    <addressOffset>0x58</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>TLOT</name>
                            <description>Non-Touch Judgment Criterion Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THOT</name>
                            <description>Touch Judgment Criterion Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AJCR0</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCR</alternateRegister>
                    <addressOffset>0x58</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>TLOT</name>
                            <description>Non-Touch Judgment Criterion Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
