ra-rs/ra/svd/vendor/R7FA4L1BD.svd
                <register>
                    <name>CFSAMONA</name>
                    <description>Code Flash Security Attribution Monitor Register A</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff007fff</resetMask>
                    <fields>
                        <field>
                            <name>CFS2</name>
                            <description>Code Flash Secure area 2</description>
                            <lsb>15</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFSAMONB</name>
                    <description>Code Flash Security Attribution Monitor Register B</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff0003ff</resetMask>
                    <fields>
                        <field>
                            <name>CFS1</name>
                            <description>Code Flash Secure area 1</description>
                            <lsb>10</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFSAMON</name>
                    <description>Data Flash Security Attribution Monitor Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffff03ff</resetMask>
                    <fields>
                        <field>
                            <name>DFS</name>
                            <description>Data flash Secure area</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSAMONA</name>
                    <description>SRAM Security Attribution Monitor Register A</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffe01fff</resetMask>
                    <fields>
                        <field>
                            <name>SS2</name>
                            <description>SRAM Secure area 2</description>
                            <lsb>13</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSAMONB</name>
                    <description>SRAM Security Attribution Monitor Register B</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffe003ff</resetMask>
                    <fields>
                        <field>
                            <name>SS1</name>
                            <description>SRAM secure area 1</description>
                            <lsb>10</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLMMON</name>
                    <description>Device Lifecycle Management State Monitor Register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xfffffff0</resetMask>
                    <fields>
                        <field>
                            <name>DLMMON</name>
                            <description>Device Lifecycle Management State Monitor</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x2</name>
                                    <description>SSD</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3</name>
                                    <description>NSECSD</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4</name>
                                    <description>DPL</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5</name>
                                    <description>LCK_DBG</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6</name>
                                    <description>LCK_BOOT</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7</name>
                                    <description>RMA_REQ</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8</name>
                                    <description>RMA_ACK</description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Reserved</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
