ra-rs/ra/svd/vendor/R7FA4L1BD.svd
                <register>
                    <name>FCR</name>
                    <description>FIFO Control Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xf800</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>FM</name>
                            <description>FIFO Mode Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-FIFO mode. Selects TDR/RDR or TDRHL/RDRHL for communication. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>FIFO mode. Selects FTDRHL/FRDRHL for communication. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFRST</name>
                            <description>Receive FIFO Data Register Reset</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not reset FRDRHL</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset FRDRHL</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TFRST</name>
                            <description>Transmit FIFO Data Register Reset</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not reset FTDRHL</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset FTDRHL</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DRES</name>
                            <description>Receive Data Ready Error Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Receive data full interrupt (SCIn_RXI)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Receive error interrupt (SCIn_ERI)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TTRG</name>
                            <description>Transmit FIFO Data Trigger Number</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTRG</name>
                            <description>Receive FIFO Data Trigger Number</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSTRG</name>
                            <description>RTS Output Active Trigger Number Select</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FDR</name>
                    <description>FIFO Data Count Register</description>
                    <addressOffset>0x16</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>R</name>
                            <description>Receive FIFO Data Count</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>T</name>
                            <description>Transmit FIFO Data Count</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LSR</name>
                    <description>Line Status Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>ORER</name>
                            <description>Overrun Error Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No overrun error occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Overrun error occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FNUM</name>
                            <description>Framing Error Count</description>
                            <lsb>2</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PNUM</name>
                            <description>Parity Error Count</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDR</name>
                    <description>Compare Match Data Register</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPD</name>
                            <description>Compare Match Data</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPTR</name>
                    <description>Serial Port Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>RXDMON</name>
                            <description>Serial Input Data Monitor</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When RINV = 0, RXDn terminal is the low level. When RINV = 1, RXDn terminal is the high level. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When RINV = 0, RXDn terminal is the high level. When RINV = 1, RXDn terminal is the low level. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPB2DT</name>
                            <description>Serial Port Break Data Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When TINV = 0, low level is output in TXDn terminal. When TINV = 1, high level is output in TXDn terminal. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When TINV = 0, high level is output in TXDn terminal. When TINV = 1, low level is output in TXDn terminal. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPB2IO</name>
                            <description>Serial Port Break I/O</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not output value of SPB2DT bit on TXDn pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output value of SPB2DT bit on TXDn pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RINV</name>
                            <description>RXD Invert Bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Received data from RXDn is not inverted and input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Received data from RXDn is inverted and input</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TINV</name>
                            <description>TXD Invert Bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Transmit data is not inverted and output to TXDn</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transmit data is inverted and output to TXDn</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASEN</name>
                            <description>Adjust Receive Sampling Timing Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Adjust sampling timing disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Adjust sampling timing enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ATEN</name>
                            <description>Adjust Transmit Timing Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Adjust transmit timing disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Adjust transmit timing enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ACTR</name>
                    <description>Adjustment Communication Timing Register</description>
                    <addressOffset>0x1D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>AST</name>
                            <description>Adjustment Value for Receive Sampling Timing</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AJD</name>
                            <description>Adjustment Direction for Receive Sampling Timing</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The sampling timing is adjusted backward to the middle of bit.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The sampling timing is adjusted forward to the middle of bit.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ATT</name>
                            <description>Adjustment Value for Transmit Timing</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AET</name>
                            <description>Adjustment Edge for Transmit Timing</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Adjust the rising edge timing</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Adjust the falling edge timing</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
